---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.GetCategoryId
source: html/33a5395f-c9cd-2a97-7b98-d156f9b1232d.htm
---
# Autodesk.Revit.DB.ElementRecord.GetCategoryId Method

Gets the category id of the element record.

## Syntax (C#)
```csharp
public ElementId GetCategoryId()
```

## Returns
The category id.